{
  "metadata": {
    "total_size": 6926664844
  },
  "weight_map": {
    "audio_encoder.decoder.layers.0.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.0.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.0.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.1.lstm.bias_hh_l0": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.1.lstm.bias_hh_l1": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.1.lstm.bias_ih_l0": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.1.lstm.bias_ih_l1": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.1.lstm.weight_hh_l0": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.1.lstm.weight_hh_l1": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.1.lstm.weight_ih_l0": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.1.lstm.weight_ih_l1": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.10.block.1.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.10.block.1.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.10.block.1.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.10.block.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.10.block.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.10.block.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.12.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.12.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.12.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.13.block.1.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.13.block.1.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.13.block.1.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.13.block.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.13.block.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.13.block.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.15.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.15.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.15.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.4.block.1.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.4.block.1.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.4.block.1.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.4.block.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.4.block.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.4.block.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.6.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.6.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.6.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.7.block.1.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.7.block.1.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.7.block.1.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.7.block.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.7.block.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.7.block.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.9.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.9.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.decoder.layers.9.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.0.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.0.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.0.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.1.block.1.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.1.block.1.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.1.block.1.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.1.block.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.1.block.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.1.block.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.10.block.1.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.10.block.1.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.10.block.1.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.10.block.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.10.block.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.10.block.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.12.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.12.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.12.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.13.lstm.bias_hh_l0": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.13.lstm.bias_hh_l1": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.13.lstm.bias_ih_l0": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.13.lstm.bias_ih_l1": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.13.lstm.weight_hh_l0": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.13.lstm.weight_hh_l1": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.13.lstm.weight_ih_l0": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.13.lstm.weight_ih_l1": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.15.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.15.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.15.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.4.block.1.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.4.block.1.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.4.block.1.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.4.block.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.4.block.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.4.block.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.6.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.6.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.6.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.7.block.1.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.7.block.1.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.7.block.1.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.7.block.3.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.7.block.3.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.7.block.3.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.9.conv.bias": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.9.conv.weight_g": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.encoder.layers.9.conv.weight_v": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.0.codebook.cluster_size": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.0.codebook.embed": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.0.codebook.embed_avg": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.0.codebook.inited": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.1.codebook.cluster_size": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.1.codebook.embed": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.1.codebook.embed_avg": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.1.codebook.inited": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.2.codebook.cluster_size": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.2.codebook.embed": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.2.codebook.embed_avg": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.2.codebook.inited": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.3.codebook.cluster_size": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.3.codebook.embed": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.3.codebook.embed_avg": "pytorch_model-00001-of-00002.bin",
    "audio_encoder.quantizer.layers.3.codebook.inited": "pytorch_model-00001-of-00002.bin",
    "decoder.lm_heads.0.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.lm_heads.1.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.lm_heads.2.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.lm_heads.3.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.lm_heads.4.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.lm_heads.5.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.lm_heads.6.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.lm_heads.7.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.model.decoder.embed_positions.weights": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.embed_tokens.0.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.embed_tokens.1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.embed_tokens.2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.embed_tokens.3.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.embed_tokens.4.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.embed_tokens.5.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.embed_tokens.6.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.embed_tokens.7.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layer_norm.bias": "pytorch_model-00002-of-00002.bin",
    "decoder.model.decoder.layer_norm.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.model.decoder.layers.0.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.0.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.1.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.10.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.11.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.12.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.13.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.14.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.15.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.16.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.17.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.18.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.19.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.2.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.20.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.21.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.22.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.23.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.24.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.25.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.26.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.27.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.28.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.self_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.29.self_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.encoder_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.encoder_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.encoder_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.encoder_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.encoder_attn_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.encoder_attn_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.fc1.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.fc2.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.final_layer_norm.bias": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.model.decoder.layers.3.self_attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
